import NumberTheory.Notations
import NumberTheory.Theorems


-- 1 задание с муниципального этапа
-- Известно, что выражение 6n + 11m делится на 31 для некоторых целых n и m.
-- Докажите, что n + 7m делится на 31

-- 5(6n + 11m) + (n+7m) = 31n + 62m
-- тогда правая часть делится на 31
-- первое слагаемое делится
-- значит делится и второе

-- что мы делаем в лине:
-- пишем что 6n + 11m = 31k
-- доказываем что
-- 5(6n + 11m) + (n+7m) делится на 31
-- (используем свидетеля n+2m)
-- переписываем это как 5(6n + 11m) + (n+7m) = 31k1
-- переписываем отсюда 6n+11m как 31k
-- 5 * 31k + (n+7) = 31k1
-- наша цель 31 ∣ (n+7m)
-- подставим свидетеля k1-5k
-- цель n+7m = 31k1 - 5 * 31k
-- перписываем как
-- n + 7m = 5 * 31k + (n+7) - 5 * 31k
-- 5 * 31k взаимоуничтожаются
-- n + 7m = n + 7m
theorem ex1 (n m : ℤ) (h : 31 ∣ (6 * n + 11 * m)) : 31 ∣ (n + 7*m) := by
  obtain ⟨k,hk⟩ := h
  have h1: 31 ∣ (5*(6 * n + 11 * m) + (n + 7*m)) := by
    use (n + 2*m)
    ring
  rw [hk] at h1
  obtain ⟨k1,hk1⟩ := h1
  use k1-k*5
  rw [Int.mul_sub, ← hk1]
  ring
