import NumberTheory.Notations
import NumberTheory.Theorems


-- есть пос-ть 12008 120308 1203308...
-- нужно доказать что любое число N пос-ти делится на 19
-- заметим что чтобы из n числа пос-ти сделать n+1 мы должны
-- n * 10 + 228
-- тогда чтобы определить функцию для получения числа из пос-ти
-- мы должны задать ее рекурсивно
-- функция принимает натуральное число и выдает число находящееся в посл-ти под этим номером
-- ну или можно сказать что функция принимает кол во троек между нулями в числе 12008
-- 0 - 12008, 1 - 120308, 2 - 1203308
def sandwich : ℕ → ℕ
  | 0 => 12008
  | n+1 => (sandwich n) * 10 + 228

-- тогда нам нужно доказать что для любого n (sandwich n) делится на 19
-- доказываем через индукцию по n
-- база: n=0
-- значит sandwich 0 = 12008
-- что делится на 19, закрываем тактикой decide
-- шаг: n = d+1
-- перепишем sandwich d+1 как sandwich d * 10 + 228
-- тогда доказываем что sandwich d делится на 19 => sandwich d * 10 делится на 19
-- потом доказываем что 228 делится на 19
-- ну и в конце мы раскрываем:
-- 19 ∣ sandwich d * 10 как sandwich d * 10 = 19k1
-- 19 | 228 как 228 = 19k2
-- при этом наша цель это 19 ∣ sandiwch d * 10 + 228
-- мы ее переписываем как 19 ∣ 19k1 + 19k2
-- не сложно догадаться что тогда свидетель k1+k2
-- 19k1 + 19k2 = 19(k1+k2)
theorem ex8 (n : ℕ) : 19 ∣ (sandwich n) := by
  induction n with
  | zero =>
    decide
  | succ d hd =>
    change 19 ∣ ((sandwich d) * 10 + 228)
    have h1: 19 ∣ (sandwich d * 10) := by
      obtain ⟨k,hk⟩ := hd
      rw [hk]
      use k*10
      ring
    have h2: 19 ∣ 228 := by decide
    obtain ⟨k1,hk1⟩ := h1
    obtain ⟨k2,hk2⟩ := h2
    rw [hk1, hk2]
    use k1+k2
    ring
